final List<Map<String, dynamic>> destinations = [
  {
    'name': 'بريدة',
    'country': 'السعودية',
    'latitude': 26.3372, // إحداثيات خط العرض
    'longitude': 43.9735, // إحداثيات خط الطول
    'attractions': [
      {
        'name': 'عسيب',
        'description': 'هي أكبر تجمع ريفي في منطقة القصيم تضم عدة مطاعم و مقاهي توفر جلسات داخليه و خارجيه التي تمتاز بتراث القصيم وهو النخل  يوجد تعدد للخيارات من ناحية الفعاليات و كثرة تعدد المطاعم و المقاهي الممتازه و المختلفه بنوعها',
        'image': 'assets/images/asseb.jpg',
        'latitude': 26.3375,
        'longitude': 43.9737
      },
      {
        'name': 'متحف العقيلات',
        'description': 'يعتبـر مـن المتاحف الخاصة المتخصصة المميزة في المنطقة ويحتوي على مجموعة من القطع الأثرية والمعلومات التاريخية للمنطقة.',
        'image': 'assets/images/ak.jpg',
        'latitude': 26.3380,
        'longitude': 43.9740
      },
      {
        'name': 'جبل خزاز',
        'description': 'يقع جنوب غرب مدينة الرس في منطقة القصيم، ويُعد وجهة سياحية مميزة تجمع بين الطبيعة والتاريخ. يضم المنطقة المحيطة به مطاعم واستراحات تقدم خدمات للزوار، مما يجعله مكانًا مناسبًا للتنزه والاستمتاع بالأجواء الطبيعية.',
        'image': 'assets/images/khazarmontin.jpg',
        'latitude': 26.3400,
        'longitude': 43.9750
      }
    ]
  },
  {
    'name': 'الرس',
    'country': 'السعودية',
    'latitude': 25.6343, // إحداثيات خط العرض
    'longitude': 43.5256, // إحداثيات خط الطول
    'attractions': [
      {
        'name': 'ريف جلاس',
        'description': 'يعتبر مزار سياحي مفتوح ٢٤ ساعة اختلط فيه الطابع المعاصر القديم والجديد ، تتوفر فيه العديد من الكوفيهات والمطاعم  ، ويوجد جلسات داخلية وخارجية عند كل محل ، يتوفر ايضا مصلى ودورات مياة',
        'image': 'assets/images/jalas.jpg',
        'latitude': 25.6345,
        'longitude': 43.5260
      },
      {
        'name': 'بوليفارد العوض',
        'description': 'يُعد بوليڤارد العوض وجهة حديثة ومثالية للعائلات والأفراد الذين يبحثون عن تجربة متكاملة من التسوق والترفيه وتناول الطعام في بيئة راقية ومريحة. يضم مجموعة متنوعة من المتاجر والمطاعم والمقاهي، مما يوفر تجربة تسوق تلبي احتياجات الزوار.',
        'image': 'assets/images/boulevardawad.jpg',
        'latitude': 25.6350,
        'longitude': 43.5270
      },
      {
        'name': 'برج الشنانه',
        'description': 'معلم تاريخي في بلدة الشنانة غرب الرس بمنطقة القصيم، يعود تاريخه إلى أكثر من 200 عام. يتميز بشكله المخروطي واستخدامه كنقطة مراقبة للدفاع وتحذير السكان. يعد من أبرز المواقع التاريخية في المنطقة.',
        'image': 'assets/images/brj.jpg',
        'latitude': 25.6360,
        'longitude': 43.5280
      }
    ]
  },
  {
    'name': 'عنيزة',
    'country': 'السعودية',
    'latitude': 26.0904, // إحداثيات خط العرض
    'longitude': 43.9773, // إحداثيات خط الطول
    'attractions': [
      {
        'name': 'جادة النخيل',
        'description':'مزرعة في محافظة عنيزة تحولت الى مزار سياحي حيث تم استغلاله بمشاريع الجمعية التعاونية السياحيه بعنيزة ، يوجد بها فعاليات وجلسات خاريجيه ومقاهي جواريفية وتمشيه على طول المزرعة بحيث يكتشف الزائر المناظر الطبيعية.',
        'image': 'assets/images/jada.jpg',
        'latitude': 26.0905,
        'longitude': 43.9775
      },
      {
        'name': 'بوليفارد عنيزة',
        'description': 'مجمع تجاري يحتوي على مجموعة متنوعة من المحلات',
        'image': 'assets/images/aneeza.jpg',
        'latitude': 26.0910,
        'longitude': 43.9780
      },
      {
        'name': 'غضراء',
        'description': 'مزرعة غضراء في عنيزة تعد واحدة من الوجهات التي تجمع بين الطبيعة والهدوء، وهي مكان مناسب للاسترخاء والتمتع بالأجواء الريفيةتتميز المزرعة بوجود مساحات خضراء واسعة مليئة بالنخيل والأشجار',
        'image': 'assets/images/gadraa.jpg',
        'latitude': 26.0920,
        'longitude': 43.9790
      }
    ]
  },
];
